---
kind: method
id: M:Autodesk.Revit.DB.ElementId.#ctor(Autodesk.Revit.DB.BuiltInCategory)
source: html/8251e7b1-ea91-ec9c-c8da-6f53a6638811.htm
---
# Autodesk.Revit.DB.ElementId.#ctor Method

Create an ElementId handle with the given BuiltInCategory id.

## Syntax (C#)
```csharp
public ElementId(
	BuiltInCategory categoryId
)
```

## Parameters
- **categoryId** (`Autodesk.Revit.DB.BuiltInCategory`) - The id.